zephyrproject-rtos/zephyr/drivers/i2c/i2c_esp32.c
/*
 * Copyright (c) 2017 Intel Corporation
 * Copyright (c) 2021-2026 Espressif Systems (Shanghai) Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT espressif_esp32_i2c

/* Include esp-idf headers first to avoid redefining BIT() macro */
#include <esp_rom_gpio.h>
#include <soc/gpio_sig_map.h>
#include <hal/i2c_ll.h>
#include <hal/i2c_hal.h>
#include <hal/gpio_hal.h>
#include <esp_clk_tree.h>
#include <esp_private/esp_clk_tree_common.h>
#include <clk_ctrl_os.h>
#include <esp_cpu.h>
#include <esp_rom_sys.h>

#include <soc.h>
#include <zephyr/drivers/interrupt_controller/intc_esp32.h>
#include <errno.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/sys/util.h>
#include <string.h>

#if CONFIG_PM
#include <zephyr/pm/policy.h>
#endif

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(i2c_esp32, CONFIG_I2C_LOG_LEVEL);

#include "i2c-priv.h"

#if CONFIG_ESP32_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP && SOC_I2C_SUPPORT_SLEEP_RETENTION
#define I2C_SLEEP_RETENTION_ENABLED 1
#else
#define I2C_SLEEP_RETENTION_ENABLED 0
#endif

#if I2C_SLEEP_RETENTION_ENABLED
#include <hal/i2c_periph.h>
#include <esp_private/sleep_retention.h>
#endif

#if defined(CONFIG_I2C_TARGET) && SOC_I2C_SUPPORT_SLAVE && SOC_I2C_SLAVE_CAN_GET_STRETCH_CAUSE
#define I2C_ESP32_TARGET_ENABLED 1
#else
#define I2C_ESP32_TARGET_ENABLED 0
#endif

#define I2C_FILTER_CYC_NUM_DEF 7	/* Number of apb cycles filtered by default */
#define I2C_CLR_BUS_SCL_NUM 9		/* Number of SCL clocks to restore SDA signal */
#define I2C_CLR_BUS_HALF_PERIOD_US 5	/* Period of SCL clock to restore SDA signal */
#define I2C_TRANSFER_TIMEOUT_MSEC 500	/* Transfer timeout period */

/* Freq limitation when using different clock sources */
#define I2C_CLK_LIMIT_REF_TICK (1 * 1000 * 1000 / 20)	/* REF_TICK, no more than REF_TICK/20*/
#define I2C_CLK_LIMIT_APB (80 * 1000 * 1000 / 20)	/* Limited by APB, no more than APB/20 */
#define I2C_CLK_LIMIT_RTC (20 * 1000 * 1000 / 20)	/* Limited by RTC, no more than RTC/20 */
#define I2C_CLK_LIMIT_XTAL (40 * 1000 * 1000 / 20)	/* Limited by RTC, no more than XTAL/20 */

#define I2C_CLOCK_INVALID                 (-1)

enum i2c_status_t {
	I2C_STATUS_READ,	/* read status for current controller command */
	I2C_STATUS_WRITE,	/* write status for current controller command */
	I2C_STATUS_IDLE,	/* idle status for current controller command */
	I2C_STATUS_ACK_ERROR,	/* ack error status for current controller command */
	I2C_STATUS_DONE,	/* I2C command done */
	I2C_STATUS_TIMEOUT,	/* I2C bus status error, and operation timeout */
};

struct i2c_esp32_data {
	i2c_hal_context_t hal;
	struct k_sem cmd_sem;
	struct k_sem transfer_sem;
	volatile enum i2c_status_t status;
	uint32_t dev_config;
	int cmd_idx;
	int irq_line;
#if CONFIG_PM
	bool pm_policy_state_on;
#endif
#if I2C_ESP32_TARGET_ENABLED
	struct i2c_target_config *target_cfg;
	bool target_attached;
	bool target_reading;
	bool target_writing;
	bool target_in_controller_xfer;
#if defined(CONFIG_I2C_TARGET_BUFFER_MODE)
	bool target_buf_mode;
	uint32_t target_rx_len;
	uint8_t target_rx_buf[CONFIG_I2C_ESP32_TARGET_BUF];
	const uint8_t *target_tx_buf;
	uint32_t target_tx_len;
	uint32_t target_tx_idx;
#endif
#endif
};

#if CONFIG_PM
static void i2c_esp32_pm_policy_state_lock_get(struct i2c_esp32_data *data)
{
	unsigned int key = irq_lock();

	if (!data->pm_policy_state_on) {
		data->pm_policy_state_on = true;
		pm_policy_state_all_lock_get();
	}

	irq_unlock(key);
}

static void i2c_esp32_pm_policy_state_lock_put(struct i2c_esp32_data *data)
{
	unsigned int key = irq_lock();

	if (data->pm_policy_state_on) {
		data->pm_policy_state_on = false;
		pm_policy_state_all_lock_put();
	}

	irq_unlock(key);
}
#endif /* CONFIG_PM */

typedef void (*irq_connect_cb)(void);

struct i2c_esp32_config {
	int index;

	const struct device *clock_dev;
#ifndef I2C_LL_SUPPORT_HW_CLR_BUS
	const struct gpio_dt_spec scl;
	const struct gpio_dt_spec sda;
#endif
	const struct pinctrl_dev_config *pcfg;

	const clock_control_subsys_t clock_subsys;

	const struct {
		bool tx_lsb_first;
		bool rx_lsb_first;
	} mode;

	void (*irq_configure)(void);

	const uint32_t bitrate;
	const uint32_t scl_timeout;
};

static uint32_t i2c_get_src_clk_freq(i2c_clock_source_t clk_src)
{
	uint32_t periph_src_clk_hz = 0;

	switch (clk_src) {
#if SOC_I2C_SUPPORT_APB
	case I2C_CLK_SRC_APB:
		periph_src_clk_hz = esp_clk_apb_freq();
		break;
#endif
#if SOC_I2C_SUPPORT_XTAL
	case I2C_CLK_SRC_XTAL:
		periph_src_clk_hz = esp_clk_xtal_freq();
		break;
#endif
#if SOC_I2C_SUPPORT_RTC
	case I2C_CLK_SRC_RC_FAST:
		esp_clk_tree_enable_src(SOC_MOD_CLK_RC_FAST, true);
		esp_clk_tree_src_get_freq_hz(SOC_MOD_CLK_RC_FAST,
					     ESP_CLK_TREE_SRC_FREQ_PRECISION_APPROX,
					     &periph_src_clk_hz);
		break;
#endif
#if SOC_I2C_SUPPORT_REF_TICK
	case RMT_CLK_SRC_REF_TICK:
		periph_src_clk_hz = REF_CLK_FREQ;
		break;
#endif
	default:
		LOG_ERR("clock source %d is not supported", clk_src);
		break;
	}

	return periph_src_clk_hz;
}

static i2c_clock_source_t i2c_get_clk_src(uint32_t clk_freq)
{
	i2c_clock_source_t clk_srcs[] = SOC_I2C_CLKS;

	for (size_t i = 0; i < ARRAY_SIZE(clk_srcs); i++) {
		/* I2C SCL clock frequency should not larger than clock source frequency/20 */
		if (clk_freq <= (i2c_get_src_clk_freq(clk_srcs[i]) / 20)) {
			return clk_srcs[i];
		}
	}

	return I2C_CLOCK_INVALID;
}

#ifndef I2C_LL_SUPPORT_HW_CLR_BUS
static int i2c_esp32_config_pin(const struct device *dev)
{
	const struct i2c_esp32_config *config = dev->config;

	if (config->index >= SOC_I2C_NUM) {
		LOG_ERR("Invalid I2C peripheral number");
		return -EINVAL;
	}

	/* Reattach the I2C peripheral signals to SDA/SCL after the bit-bang bus
	 * recovery in i2c_controller_clear_bus() temporarily drove them as GPIOs.
	 *
	 * The previous esp_rom_gpio_matrix_*() reattach passed gpio.pin -- the
	 * per-controller pin index -- as the absolute GPIO number. That only
	 * holds for the gpio0 bank (GPIO0..31). For SDA/SCL on gpio1
	 * (GPIO32..39, pin index 0..7) it rerouted the I2C signals onto
	 * GPIO0/1 instead; GPIO1 is the default UART0 TX, so recovery hijacked
	 * the console and the bus was never actually restored.
	 *
	 * Reapplying the pinctrl default state restores exactly the mux the
	 * driver installed at init, regardless of which GPIO bank the pins are
	 * on.
	 */
	return pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
}
#endif

/* Some target device will die by accident and keep the SDA in low level,
 * in this case, controller should send several clock to make the target release the bus.
 * Target mode of ESP32 might also get in wrong state that held the SDA low,
 * in this case, controller device could send a stop signal to make esp32 target release the bus.
 **/
static void IRAM_ATTR i2c_controller_clear_bus(const struct device *dev)
{
	struct i2c_esp32_data *data = (struct i2c_esp32_data *const)(dev)->data;

#ifndef I2C_LL_SUPPORT_HW_CLR_BUS
	const struct i2c_esp32_config *config = dev->config;
	const int scl_half_period = I2C_CLR_BUS_HALF_PERIOD_US; /* use standard 100kHz data rate */
	int i = 0;

	gpio_pin_configure_dt(&config->scl, GPIO_OUTPUT);
	gpio_pin_configure_dt(&config->sda, GPIO_OUTPUT | GPIO_INPUT);
	/* If a TARGET device was in a read operation when the bus was interrupted, */
	/* the TARGET device is controlling SDA. If the target is sending a stream of ZERO bytes, */
	/* it will only release SDA during the  ACK bit period. So, this reset code needs */
	/* to synchronize the bit stream with either the ACK bit, or a 1 bit to correctly */
	/* generate a STOP condition. */
	gpio_pin_set_dt(&config->sda, 1);
	esp_rom_delay_us(scl_half_period);
	while (!gpio_pin_get_dt(&config->sda) && (i++ < I2C_CLR_BUS_SCL_NUM)) {
		gpio_pin_set_dt(&config->scl, 1);
		esp_rom_delay_us(scl_half_period);
		gpio_pin_set_dt(&config->scl, 0);
		esp_rom_delay_us(scl_half_period);
	}
	gpio_pin_set_dt(&config->sda, 0); /* setup for STOP */
	gpio_pin_set_dt(&config->scl, 1);
	esp_rom_delay_us(scl_half_period);
	gpio_pin_set_dt(&config->sda, 1); /* STOP, SDA low -> high while SCL is HIGH */
	i2c_esp32_config_pin(dev);
#else
	i2c_ll_master_clr_bus(data->hal.dev, I2C_LL_RESET_SLV_SCL_PULSE_NUM_DEFAULT, true);
#endif
	i2c_ll_update(data->hal.dev);
}

static void IRAM_ATTR i2c_hw_fsm_reset(const struct device *dev)
{
	struct i2c_esp32_data *data = (struct i2c_esp32_data *const)(dev)->data;

#if !I2C_LL_SUPPORT_HW_FSM_RST
	const struct i2c_esp32_config *config = dev->config;
	int scl_low_period, scl_high_period;
	int scl_start_hold, scl_rstart_setup;
	int scl_stop_hold, scl_stop_setup;
	int sda_hold, sda_sample;
	int timeout;
	uint8_t filter_cfg;

	i2c_ll_get_scl_timing(data->hal.dev, &scl_high_period, &scl_low_period);
	i2c_ll_get_start_timing(data->hal.dev, &scl_rstart_setup, &scl_start_hold);
	i2c_ll_get_stop_timing(data->hal.dev, &scl_stop_setup, &scl_stop_hold);
	i2c_ll_get_sda_timing(data->hal.dev, &sda_sample, &sda_hold);
	i2c_ll_get_tout(data->hal.dev, &timeout);
	i2c_ll_master_get_filter(data->hal.dev, &filter_cfg);

