zephyrproject-rtos/zephyr/drivers/i2c/i2c_esp32.c
	if (!cfg) {
		return -EINVAL;
	}
	if (data->target_attached) {
		return -EBUSY;
	}

	k_sem_take(&data->transfer_sem, K_FOREVER);

	data->target_cfg = cfg;
	data->target_reading = false;
	data->target_writing = false;
#if defined(CONFIG_I2C_TARGET_BUFFER_MODE)
	data->target_buf_mode = (cfg->callbacks->buf_write_received != NULL) ||
				(cfg->callbacks->buf_read_requested != NULL);
	data->target_rx_len = 0;
	data->target_tx_buf = NULL;
	data->target_tx_len = 0;
	data->target_tx_idx = 0;
#endif

	i2c_esp32_target_setup(dev);

	data->target_attached = true;
	data->dev_config = 0;

#if CONFIG_PM
	i2c_esp32_pm_policy_state_lock_get(data);
#endif

	k_sem_give(&data->transfer_sem);

	return 0;
}

static int i2c_esp32_target_unregister(const struct device *dev, struct i2c_target_config *cfg)
{
	struct i2c_esp32_data *data = dev->data;

	if (!data->target_attached) {
		return -EINVAL;
	}
	if (cfg != data->target_cfg) {
		return -EINVAL;
	}

	k_sem_take(&data->transfer_sem, K_FOREVER);

	i2c_esp32_target_teardown(dev);

	data->target_attached = false;
	data->target_cfg = NULL;
	data->target_reading = false;
	data->target_writing = false;
#if defined(CONFIG_I2C_TARGET_BUFFER_MODE)
	data->target_buf_mode = false;
	data->target_rx_len = 0;
	data->target_tx_buf = NULL;
	data->target_tx_len = 0;
	data->target_tx_idx = 0;
#endif

	i2c_hal_master_init(&data->hal);
	i2c_esp32_configure_data_mode(dev);

#if CONFIG_PM
	i2c_esp32_pm_policy_state_lock_put(data);
#endif

	k_sem_give(&data->transfer_sem);

	return 0;
}
#endif

static DEVICE_API(i2c, i2c_esp32_driver_api) = {
	.configure = i2c_esp32_configure,
	.get_config = i2c_esp32_get_config,
	.transfer = i2c_esp32_transfer,
	.recover_bus = i2c_esp32_recover,
#if I2C_ESP32_TARGET_ENABLED
	.target_register = i2c_esp32_target_register,
	.target_unregister = i2c_esp32_target_unregister,
#endif
#ifdef CONFIG_I2C_RTIO
	.iodev_submit = i2c_iodev_submit_fallback,
#endif
};

#if I2C_SLEEP_RETENTION_ENABLED
static esp_err_t i2c_esp32_create_sleep_retention_cb(void *arg)
{
	uint32_t port = (uint32_t)(uintptr_t)arg;

	return sleep_retention_entries_create(i2c_regs_retention[port].link_list,
					      i2c_regs_retention[port].link_num,
					      REGDMA_LINK_PRI_I2C,
					      i2c_regs_retention[port].module_id);
}

static void i2c_esp32_sleep_retention_init(uint32_t port)
{
	sleep_retention_module_init_param_t init_param = {
		.cbs = {.create = {.handle = i2c_esp32_create_sleep_retention_cb,
				   .arg = (void *)(uintptr_t)port}},
		.depends = RETENTION_MODULE_BITMAP_INIT(CLOCK_SYSTEM),
		.attribute = SLEEP_RETENTION_MODULE_ATTR_ATTACH};

	esp_err_t err = sleep_retention_module_init(i2c_regs_retention[port].module_id,
						    &init_param);

	if (err == ESP_OK) {
		err = sleep_retention_module_allocate(i2c_regs_retention[port].module_id);
	}
	if (err == ESP_OK) {
		err = sleep_retention_module_attach(i2c_regs_retention[port].module_id);
	}
	if (err != ESP_OK) {
		LOG_WRN("I2C%lu sleep retention init failed (%d)", (unsigned long)port, err);
	}
}
#endif /* I2C_SLEEP_RETENTION_ENABLED */

static int IRAM_ATTR i2c_esp32_init(const struct device *dev)
{
	const struct i2c_esp32_config *config = dev->config;
	struct i2c_esp32_data *data = (struct i2c_esp32_data *const)(dev)->data;

#ifndef I2C_LL_SUPPORT_HW_CLR_BUS
	if (!gpio_is_ready_dt(&config->scl)) {
		LOG_ERR("SCL GPIO device is not ready");
		return -EINVAL;
	}

	if (!gpio_is_ready_dt(&config->sda)) {
		LOG_ERR("SDA GPIO device is not ready");
		return -EINVAL;
	}
#endif
	int ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);

	if (ret < 0) {
		LOG_ERR("Failed to configure I2C pins");
		return -EINVAL;
	}

	if (!device_is_ready(config->clock_dev)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	clock_control_on(config->clock_dev, config->clock_subsys);

	config->irq_configure();

	i2c_hal_init(&data->hal, config->index);

	i2c_hal_master_init(&data->hal);

	i2c_esp32_configure_data_mode(dev);

	ret = i2c_esp32_configure(dev, I2C_MODE_CONTROLLER | i2c_map_dt_bitrate(config->bitrate));

	if (ret < 0) {
		return ret;
	}

#if I2C_SLEEP_RETENTION_ENABLED
	if (config->index < SOC_HP_I2C_NUM) {
		i2c_esp32_sleep_retention_init(config->index);
	}
#endif

	return 0;
}

#define I2C(idx) DT_NODELABEL(i2c##idx)

#ifndef I2C_LL_SUPPORT_HW_CLR_BUS
#define I2C_ESP32_GET_PIN_INFO(idx)					\
	.scl = GPIO_DT_SPEC_GET(I2C(idx), scl_gpios),			\
	.sda = GPIO_DT_SPEC_GET(I2C(idx), sda_gpios),
#else
#define I2C_ESP32_GET_PIN_INFO(idx)
#endif /* I2C_LL_SUPPORT_HW_CLR_BUS */

#define I2C_ESP32_TIMEOUT(inst)						\
	COND_CODE_1(DT_NODE_HAS_PROP(I2C(inst), scl_timeout_us),	\
		    (DT_PROP(I2C(inst), scl_timeout_us)), (0))

#define I2C_ESP32_FREQUENCY(bitrate)					\
	 (bitrate == I2C_BITRATE_STANDARD ? KHZ(100)			\
	: bitrate == I2C_BITRATE_FAST     ? KHZ(400)			\
	: bitrate == I2C_BITRATE_FAST_PLUS  ? MHZ(1) : 0)

#define I2C_FREQUENCY(idx)						\
	I2C_ESP32_FREQUENCY(DT_PROP(I2C(idx), clock_frequency))

#define ESP32_I2C_INIT(idx)                                                                        \
                                                                                                   \
	PINCTRL_DT_DEFINE(I2C(idx));                                                               \
	static void i2c_esp32_##idx##_irq_configure(void)                                          \
	{                                                                                          \
		IRQ_CONNECT(DT_IRQN(I2C(idx)), IRQ_DEFAULT_PRIORITY, i2c_esp32_isr,                \
			    DEVICE_DT_GET(I2C(idx)),                                              \
			    ESP_INTR_FLAG_IRAM);                                                   \
		irq_enable(DT_IRQN(I2C(idx)));                                                     \
	}                                                                                          \
	static struct i2c_esp32_data i2c_esp32_data_##idx = {                                      \
		.hal =                                                                             \
			{                                                                          \
				.dev = (i2c_dev_t *)DT_REG_ADDR(I2C(idx)),                         \
			},                                                                         \
		.cmd_sem = Z_SEM_INITIALIZER(i2c_esp32_data_##idx.cmd_sem, 0, 1),                  \
		.transfer_sem = Z_SEM_INITIALIZER(i2c_esp32_data_##idx.transfer_sem, 1, 1),        \
	};                                                                                         \
                                                                                                   \
	static const struct i2c_esp32_config i2c_esp32_config_##idx = {                            \
		.index = idx,                                                                      \
		.clock_dev = DEVICE_DT_GET(DT_CLOCKS_CTLR(I2C(idx))),                              \
		.pcfg = PINCTRL_DT_DEV_CONFIG_GET(I2C(idx)),                                       \
		.clock_subsys = (clock_control_subsys_t)DT_CLOCKS_CELL(I2C(idx), offset),          \
		I2C_ESP32_GET_PIN_INFO(idx).mode =                                                 \
			{                                                                          \
				.tx_lsb_first = DT_PROP(I2C(idx), tx_lsb),                         \
				.rx_lsb_first = DT_PROP(I2C(idx), rx_lsb),                         \
			},                                                                         \
		.irq_configure = i2c_esp32_##idx##_irq_configure,                                  \
		.bitrate = I2C_FREQUENCY(idx),                                                     \
		.scl_timeout = I2C_ESP32_TIMEOUT(idx),                                             \
	};                                                                                         \
	I2C_DEVICE_DT_DEFINE(I2C(idx), i2c_esp32_init, NULL, &i2c_esp32_data_##idx,                \
			     &i2c_esp32_config_##idx, POST_KERNEL, CONFIG_I2C_INIT_PRIORITY,       \
			     &i2c_esp32_driver_api);

#if DT_NODE_HAS_STATUS_OKAY(I2C(0))
#ifndef I2C_LL_SUPPORT_HW_CLR_BUS
#if !DT_NODE_HAS_PROP(I2C(0), sda_gpios) || !DT_NODE_HAS_PROP(I2C(0), scl_gpios)
#error "Missing <sda-gpios> and <scl-gpios> properties to build for this target."
#endif
#else
#if DT_NODE_HAS_PROP(I2C(0), sda_gpios) || DT_NODE_HAS_PROP(I2C(0), scl_gpios)
#error "Properties <sda-gpios> and <scl-gpios> are not required for this target."
#endif
#endif /* !I2C_LL_SUPPORT_HW_CLR_BUS */
ESP32_I2C_INIT(0);
#endif /* DT_NODE_HAS_STATUS_OKAY(I2C(0)) */

#if DT_NODE_HAS_STATUS_OKAY(I2C(1))
#ifndef I2C_LL_SUPPORT_HW_CLR_BUS
#if !DT_NODE_HAS_PROP(I2C(1), sda_gpios) || !DT_NODE_HAS_PROP(I2C(1), scl_gpios)
#error "Missing <sda-gpios> and <scl-gpios> properties to build for this target."
#endif
#else
#if DT_NODE_HAS_PROP(I2C(1), sda_gpios) || DT_NODE_HAS_PROP(I2C(1), scl_gpios)
#error "Properties <sda-gpios> and <scl-gpios> are not required for this target."
#endif
#endif /* !I2C_LL_SUPPORT_HW_CLR_BUS */
ESP32_I2C_INIT(1);
#endif /* DT_NODE_HAS_STATUS_OKAY(I2C(1)) */
